/* ************************************************************************** */
/*                                                                            */
/*                                                        :::      ::::::::   */
/*   ft_putchar.c                                       :+:      :+:    :+:   */
/*                                                    +:+ +:+         +:+     */
/*   By: jreszka <jreszka@student.42.fr>            +#+  +:+       +#+        */
/*                                                +#+#+#+#+#+   +#+           */
/*   Created: 2016/09/25 14:05:58 by jreszka           #+#    #+#             */
/*   Updated: 2016/09/25 14:30:02 by jreszka          ###   ########.fr       */
/*                                                                            */
/* ************************************************************************** */

#include <unistd.h>

/*
**	Affiche le caractère c sur la sortie standard.
*/

void	ft_putchar(char c)
{
	if (c != '\0')
		write(1, &c, 1);
}
